app/views/movies/_movie_popup.html.haml

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 3]]
---

  - @movie.reviews.each do |review|