app/views/movies/show.html.haml

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 2]]
---

  - @movie.reviews.each do |review|