app/controllers/application_controller.rb

SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."id" = ? ORDER BY "moviegoers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_current_user
    @current_user = Moviegoer.find_by(id: session[:user_id])