app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY "movies"."title" ASC
---
    def index
        @movies = Movie.all.order(:title)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."moviegoer_id" = ? LIMIT ?  [["movie_id", 20], ["moviegoer_id", 1], ["LIMIT", 1]]
---
    def show
        id = params[:id]
        @movie = Movie.find(id)
        if @current_user
            @review = @movie.reviews.find_by(:moviegoer_id => @current_user.id)

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Titanic"], ["rating", "G"], ["description", "test"], ["release_date", "2020-10-10 00:00:00"], ["created_at", "2020-10-10 07:05:07.188630"], ["updated_at", "2020-10-10 07:05:07.188630"]]
---
    def create
        @movie = Movie.new(movie_params)
        if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "lll"], ["updated_at", "2020-10-10 07:28:06.103802"], ["id", 2]]
---
    def update
        @movie = Movie.find params[:id]
        if @movie.update(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT ?  [["title", "The Thing About Harry"], ["LIMIT", 1]]
SELECT 1 AS one FROM "movies" WHERE "movies"."title" = ? AND "movies"."description" = ? LIMIT ?
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def search_tmdb
        @search_terms = params[:search_terms]

        if @search_terms != ""
            @movies = Movie.find_in_tmdb(params[:search_terms])
            if @movies
                @movies.each do |movie_each|
                    @movie = Movie.new(title: movie_each.title, rating: "G" , release_date: movie_each.release_date , description: movie_each.overview)
                    if !(Movie.exists?(title: movie_each.title, description: movie_each.overview))
                        @movie.save