app/controllers/reviews_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def has_moviegoer_and_movie
        unless @current_user
            flash[:warning] = 'You must be logged in to create a review.'
            redirect_to '/auth/twitter'
        end
        unless (@movie = Movie.find_by(:id => params[:movie_id]))

INSERT INTO "reviews" ("potatoes", "comments", "moviegoer_id", "movie_id") VALUES (?, ?, ?, ?)  [["potatoes", 1], ["comments", "lol"], ["moviegoer_id", 1], ["movie_id", 2]]
---
    def create
        @current_user.reviews << @movie.reviews.build(params[:review].permit(:potatoes,:comments))

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def edit
        @movie = Movie.find params[:movie_id]
        @review = Review.find params[:id]

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 2], ["id", 12], ["LIMIT", 1]]
UPDATE "reviews" SET "potatoes" = ?, "comments" = ? WHERE "reviews"."id" = ?  [["potatoes", 1], ["comments", "so bad !!!"], ["id", 19]]
---
    def update
        @review = @movie.reviews.find params[:id]
        permitted = params[:review].permit(:potatoes,:comments)
        @review.update_attributes!(permitted)