app/controllers/sessions_controller.rb

SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."provider" = ? AND "moviegoers"."uid" = ? ORDER BY "moviegoers"."id" ASC LIMIT ?  [["provider", "twitter"], ["uid", "1307745051758530560"], ["LIMIT", 1]]
INSERT INTO "moviegoers" ("name", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Pasakorn_M"], ["provider", "twitter"], ["uid", "1307745051758530560"], ["created_at", "2020-09-22 08:16:07.694450"], ["updated_at", "2020-09-22 08:16:07.694450"]]
---
  def create
    auth = request.env['omniauth.auth']
    user = Moviegoer.where(provider: auth['provider'], uid: auth['uid'] ).first

    unless user
      user = Moviegoer.create_with_omniauth!(auth)