app/models/moviegoer.rb

  def self.create_with_omniauth(auth)
    Moviegoer.create!(
      :provider => auth["provider"],
      :uid => auth["uid"],
      :name => auth["info"]["name"])
---
INSERT INTO "moviegoers" ("name", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Pasakorn_M"], ["provider", "twitter"], ["uid", "1307745051758530560"], ["created_at", "2020-09-22 08:16:07.694450"], ["updated_at", "2020-09-22 08:16:07.694450"]]
INSERT INTO "moviegoers" ("name", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "educationforpakkapure"], ["provider", "twitter"], ["uid", "1314857588492771328"], ["created_at", "2020-10-10 09:23:11.429747"], ["updated_at", "2020-10-10 09:23:11.429747"]]